In [260]:
import pandas as pd 

df=pd.read_excel(r"D:\test1\da.xlsx")
df

     id    x    y
0  a001   10  100
1  a002   50   88
2  a003  501  500
3  b001   70   --
4  b002   20  300

In [261]:
df1=df.replace('--','xxx')
df1

     id    x    y
0  a001   10  100
1  a002   50   88
2  a003  501  500
3  b001   70  xxx
4  b002   20  300

In [262]:
df3=df.replace({500:'xxx','--':'xxx'})
df3

     id    x    y
0  a001   10  100
1  a002   50   88
2  a003  501  xxx
3  b001   70  xxx
4  b002   20  300

In [263]:
df5 = df.replace([500,'--'],'aaa')
df5

     id    x    y
0  a001   10  100
1  a002   50   88
2  a003  501  aaa
3  b001   70  aaa
4  b002   20  300

In [268]:
df6 = df.replace('a(.*)', "aa", regex=True)
df6

     id    x    y
0    aa   10  100
1    aa   50   88
2    aa  501  500
3  b001   70   --
4  b002   20  300

In [270]:
df7 = df.replace('--', 88, regex=True)
df7

     id    x    y    Z
0  a001   10  100  不合格
1  a002   50   88   合格
2  a003  501  500   合格
3  b001   70   88   合格
4  b002   20  300  不合格

In [271]:
def fx(item):
    if int(item)>=50:
        Z='合格'
    else:
        Z='不合格'
    return Z
df['Z']=df['x'].map(fx)
# df.columns 
df

     id    x    y    Z
0  a001   10  100  不合格
1  a002   50   88   合格
2  a003  501  500   合格
3  b001   70   --   合格
4  b002   20  300  不合格

In [273]:
df['new']=df7['x']+df7['y']
df

     id    x    y    Z   new
0  a001   10  100  不合格   110
1  a002   50   88   合格   138
2  a003  501  500   合格  1001
3  b001   70   --   合格   158
4  b002   20  300  不合格   320

In [75]:
# 3、每一列数据的格式：df.dtypes
# 这个功能与df.info()类似，如果只想查看每一列存储的是什么数据格式，那么可以直接使用df.dtypes
df.dtypes

id    object
x      int64
y     object
dtype: object

In [83]:
cols = df.columns
for col in cols:
    print(col+' : '+ str(df[col].dtype))

id : object
x : int64
y : object

In [84]:
cols = df.columns
for col in cols:
    if str(df[col].dtype) == 'object':
        print(col)

id
y

In [257]:
import pandas as pd 
import numpy as np

os.chdir(r'd:/test1')
df = pd.read_excel("./sales_data_types.xlsx")
df

,Customer Number,Customer Name,2016,2017,Percent Growth,Jan Units,Month,Day,Year,Active
0,10002,Quest Industries,$125000,"$162, 500.00",30%,500,1,10,2015,Y
1,552278,Smith Plumbing,"$92,0000","$1, 012, 000.00",10%,700,6,15,2014,Y
2,23477,ACME Industrial,"$50,000","$62, 500.00",25%,125,3,29,2016,Y
3,24900,Brekke LTD,"$350,000","$490, 000.00",4%,75,10,27,2015,Y
4,651029,Harbor Co,"$15,000","$12, 750.00",-0.15%,Closed,2,2,2014,N

In [258]:
df['2016']+df['2017']

0        $125000$162, 500.00
1    $92,0000$1, 012, 000.00
2        $50,000 $62, 500.00
3       $350,000$490, 000.00
4        $15,000 $12, 750.00
dtype: object

In [259]:
def convert_currency(var):
    """
    convert the string number to a float
    _ 去除$
    - 去除逗号，
    - 转化为浮点数类型
    """
    new_value = var.replace(",","").replace("$","")
    return float(new_value)
df=df['2016'].apply(convert_currency)
df

0    125000.0
1    920000.0
2     50000.0
3    350000.0
4     15000.0
Name: 2016, dtype: float64

In [256]:
df['2016'].apply(lambda x: x.replace(",","").replace("$",""))

KeyError: '2016'

In [239]:
df["Active"] = np.where(df["Active"] == "Y", True, False)

df["Active"]

0     True
1     True
2     True
3     True
4    False
Name: Active, dtype: bool

In [240]:
df["Percent Growth"].apply(lambda x: x.replace("%","")).astype("float")/100

0    0.3000
1    0.1000
2    0.2500
3    0.0400
4   -0.0015
Name: Percent Growth, dtype: float64

In [241]:
# pandas中pd.to_numeric()处理Jan Units中的数据
pd.to_numeric(df["Jan Units"],errors='coerce').fillna(0)

0    500.0
1    700.0
2    125.0
3     75.0
4      0.0
Name: Jan Units, dtype: float64

In [242]:
# 最后利用pd.to_datatime()将年月日进行合并
pd.to_datetime(df[['Month', 'Day', 'Year']])

0   2015-01-10
1   2014-06-15
2   2016-03-29
3   2015-10-27
4   2014-02-02
dtype: datetime64[ns]

In [243]:
# 做到这里不要忘记重新赋值，否则原始数据并没有变化
df["Jan Units"] = pd.to_numeric(df["Jan Units"],errors='coerce')
df["Start_date"] = pd.to_datetime(df[['Month', 'Day', 'Year']])

In [244]:
df

,Customer Number,Customer Name,2016,2017,Percent Growth,Jan Units,Month,Day,Year,Active,Start_date
0,10002,Quest Industries,$125000,"$162, 500.00",30%,500.0,1,10,2015,True,2015-01-10
1,552278,Smith Plumbing,"$92,0000","$1, 012, 000.00",10%,700.0,6,15,2014,True,2014-06-15
2,23477,ACME Industrial,"$50,000","$62, 500.00",25%,125.0,3,29,2016,True,2016-03-29
3,24900,Brekke LTD,"$350,000","$490, 000.00",4%,75.0,10,27,2015,True,2015-10-27
4,651029,Harbor Co,"$15,000","$12, 750.00",-0.15%,NaN,2,2,2014,False,2014-02-02

In [245]:
df.dtypes

Customer Number             int64
Customer Name              object
2016                       object
2017                       object
Percent Growth             object
Jan Units                 float64
Month                       int64
Day                         int64
Year                        int64
Active                       bool
Start_date         datetime64[ns]
dtype: object